In [2]:
import pandas as pd
import cvxpy as cp

# File path will be different on another device and must be replaced with the correct file path.
students = pd.read_csv("Sample Data (for scheduling).csv")
print(students.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60 entries, 0 to 59
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   ID               60 non-null     int64
 1   First Name       60 non-null     object
 2   Last Name        60 non-null     object
 3   Gender           60 non-null     object
 4   Age              60 non-null     int64
 5   Times Available  60 non-null     object
dtypes: int64(2), object(4)
memory usage: 2.9+ KB
None

In [3]:
students['Age'].value_counts()

Age
9     13
12    12
11    11
13     9
8      8
10     7
Name: count, dtype: int64

In [5]:
# Reference: https://www.geeksforgeeks.org/create-a-new-column-in-pandas-dataframe-based-on-the-existing-columns/
def grade(age):
    if age > 11:
        return "elem"
    else:
        return "ms"

students['Grade'] = students['Age'].map(grade)
display(students.head())

   ID First Name Last Name Gender  Age Times Available Grade
0   0     Ximeno   Colombo      M    9    [1, 2, 3, 4]    ms
1   1   Dorothea   Clayton      F    9       [1, 3, 4]    ms
2   2   Beibhinn       Nye      F   13       [1, 2, 3]  elem
3   3      Oskar   Ciobanu      M   12    [1, 2, 3, 4]  elem
4   4    Matilda   Solomon      F   11          [2, 3]    ms

In [6]:
students['Grade'].value_counts()

Grade
ms      39
elem    21
Name: count, dtype: int64

In [7]:
students['Times Available'].dtypes # Reference: https://www.geeksforgeeks.org/how-to-check-the-data-type-in-pandas-dataframe/
# We need to change this data so that it is an array.

dtype('O')

In [ ]:
# TODO: Figure out how to change 'Times Available' to an array of ints. That way it's easier to read later.

In [ ]:
# TODO: Formulation will be placed here.
# QUERY: Would it be okay to drop the gender column since we have no need for it?